drivaer-PM-emission/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [ 0 2 -2 0 0 0 0 ];
internalField uniform 0.0;

boundaryField
{
    ffminx
    {
        type zeroGradient;
    }

    ffmaxx
    {
        type fixedValue;
        value uniform 0.0;
    }

    ffminy
    {
        type slip;
    }

    ffmaxy
    {
        type slip;
    }

    ffminz
    {
        type zeroGradient;
    }

    ffmaxz
    {
        type slip;
    }

    body1
    {
        type zeroGradient;
    }

    frontD
    {
        type zeroGradient;
    }

    rearD
    {
        type zeroGradient;
    }

    frontP
    {
        type zeroGradient;
    }

    rearP
    {
        type zeroGradient;
    }

}
