drivaer-PM-emission/system/FOsurfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfaces
{
    type            surfaces;
    libs            (sampling);

    executeControl  timeStep;
    executeInterval 100; // every 0.01s
    writeControl    timeStep;
    writeInterval   100; // every 0.01s

    timeStart	    10; // starts after quasi-steady state reached
    timeEnd	    20; // end of simulation

    surfaceFormat   vtk;
    fields          (p U PMwheel PMroad);

    // interpolationScheme cellPoint;  //<- default

    surfaces
    {
        yNormal
        {
            type        cuttingPlane;
            point       (0 0 0);
            normal      (0 1 0);
            interpolate true;
        }

        isoQ
        {
            type            isoSurface;
            isoField        Q;
            isoValue        200;
            interpolate     true;
        }

        isoPMwheel
        {
            type            isoSurface;
            isoField        PMwheel;
            isoValue        0.05;
            interpolate     true;
        }

        isoPMroad
        {
            type            isoSurface;
            isoField        PMroad;
            isoValue        0.05;
            interpolate     true;
        }

        carbody
        {
            type            patch;
            patches         ("body1");
            interpolate     true;
            invariant       true;  // Unaffected by mesh motion
            surfaceFormat   vtk;
        }
    }
}


// ************************************************************************* //
