drivaer-PM-emission/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.05;

        smoother        GaussSeidel;


        nCellsInCoarsestLevel 50;
    }

    pFinal
    {
        $p;
        relTol          0;

        // Explicit specify solver for coarse-level correction to override
        // solution tolerance
        coarsestLevelCorr
        {
            // For limited residual reduction (relTol) PPCR behaves better
            // than PCG (or PPCG)
            solver          PPCR;   //PCG;
            preconditioner  DIC;
            relTol          0.05;
        }
    }

    "(U|k|B|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0;
    }

    "(PMwheel|PMroad)"
    {
        $U;
    }

    PMwheelFinal
    {
        $U;
        relTol          0;
    }

    PMroadFinal
    {
        $U;
        relTol          0;
    }

    Phi
    {
        solver GAMG;
        agglomerator faceAreaPair;
        mergeLevels 1;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 200;
        tolerance 1e-6;
        relTol 0.01;
        smoother GaussSeidel;
        nPreSweeps 0;
        nPostSweeps 2;
        nFinestSweeps 2;
        minIter 1;
    }

}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}




PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    "U.*"               1;
    "nuTilda.*"         1;
}


// ************************************************************************* //
